#+TITLE: Setup

* Preliminary setup

Declare the host to bring the site up on
  e.g: pair.myname.sharing.io

#+begin_src elisp :results none
  (setenv "PAIR_HOST" (read-from-minibuffer "PAIR_HOST: "))
#+end_src

#+name: get-pair-host
#+begin_src elisp :results silent
  (getenv "PAIR_HOST")
#+end_src

* Dependencies

** System

Install a few system packages required for development
#+begin_src shell :results silent
  sudo apt update && \
  sudo apt install -y openjdk-14-jdk rlwrap
#+end_src

#+RESULTS:
#+begin_example
Get:1 http://security.ubuntu.com/ubuntu focal-security InRelease [107 kB]
Hit:2 http://archive.ubuntu.com/ubuntu focal InRelease
Get:3 http://archive.ubuntu.com/ubuntu focal-updates InRelease [111 kB]
Get:4 http://security.ubuntu.com/ubuntu focal-security/multiverse amd64 Packages [1,169 B]
Get:5 http://security.ubuntu.com/ubuntu focal-security/restricted amd64 Packages [75.9 kB]
Get:6 http://archive.ubuntu.com/ubuntu focal-backports InRelease [98.3 kB]
Get:7 http://security.ubuntu.com/ubuntu focal-security/main amd64 Packages [367 kB]
Get:8 http://archive.ubuntu.com/ubuntu focal-updates/universe amd64 Packages [303 kB]
Get:9 http://security.ubuntu.com/ubuntu focal-security/universe amd64 Packages [111 kB]
Get:10 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 Packages [703 kB]
Get:11 http://archive.ubuntu.com/ubuntu focal-updates/multiverse amd64 Packages [21.6 kB]
Get:12 http://archive.ubuntu.com/ubuntu focal-updates/restricted amd64 Packages [88.7 kB]
Get:13 http://archive.ubuntu.com/ubuntu focal-backports/universe amd64 Packages [4,277 B]
Fetched 1,992 kB in 2s (1,076 kB/s)
Reading package lists...
Building dependency tree...
Reading state information...
17 packages can be upgraded. Run 'apt list --upgradable' to see them.
Reading package lists...
Building dependency tree...
Reading state information...
The following additional packages will be installed:
  at-spi2-core ca-certificates-java fonts-dejavu-extra java-common
  libatk-bridge2.0-0 libatk-wrapper-java libatk-wrapper-java-jni libatk1.0-0
  libatk1.0-data libatspi2.0-0 libavahi-client3 libavahi-common-data
  libavahi-common3 libcups2 libdrm-amdgpu1 libdrm-common libdrm-intel1
  libdrm-nouveau2 libdrm-radeon1 libdrm2 libfontenc1 libgif7 libgl1
  libgl1-mesa-dri libglapi-mesa libglib2.0-0 libglib2.0-data libglvnd0
  libglx-mesa0 libglx0 libice-dev libice6 libjpeg-turbo8 libjpeg8 libllvm10
  libnspr4 libnss3 libpciaccess0 libpcsclite1 libpthread-stubs0-dev
  libsensors-config libsensors5 libsm-dev libsm6 libvulkan1 libwayland-client0
  libx11-6 libx11-data libx11-dev libx11-xcb1 libxau-dev libxau6 libxaw7
  libxcb-dri2-0 libxcb-dri3-0 libxcb-glx0 libxcb-present0 libxcb-randr0
  libxcb-shape0 libxcb-sync1 libxcb1 libxcb1-dev libxcomposite1 libxdamage1
  libxdmcp-dev libxdmcp6 libxext6 libxfixes3 libxft2 libxi6 libxinerama1
  libxkbfile1 libxmu6 libxmuu1 libxpm4 libxrandr2 libxrender1 libxshmfence1
  libxt-dev libxt6 libxtst6 libxv1 libxxf86dga1 libxxf86vm1
  mesa-vulkan-drivers openjdk-14-jdk-headless openjdk-14-jre
  openjdk-14-jre-headless shared-mime-info x11-common x11-utils
  x11proto-core-dev x11proto-dev xdg-user-dirs xorg-sgml-doctools xtrans-dev
Suggested packages:
  default-jre cups-common libice-doc pciutils pcscd lm-sensors libsm-doc
  libx11-doc libxcb-doc libxt-doc openjdk-14-demo openjdk-14-source visualvm
  libnss-mdns fonts-ipafont-gothic fonts-ipafont-mincho fonts-wqy-microhei
  | fonts-wqy-zenhei fonts-indic mesa-utils
The following NEW packages will be installed:
  at-spi2-core ca-certificates-java fonts-dejavu-extra java-common
  libatk-bridge2.0-0 libatk-wrapper-java libatk-wrapper-java-jni libatk1.0-0
  libatk1.0-data libatspi2.0-0 libavahi-client3 libavahi-common-data
  libavahi-common3 libcups2 libdrm-amdgpu1 libdrm-common libdrm-intel1
  libdrm-nouveau2 libdrm-radeon1 libdrm2 libfontenc1 libgif7 libgl1
  libgl1-mesa-dri libglapi-mesa libglib2.0-0 libglib2.0-data libglvnd0
  libglx-mesa0 libglx0 libice-dev libice6 libjpeg-turbo8 libjpeg8 libllvm10
  libnspr4 libnss3 libpciaccess0 libpcsclite1 libpthread-stubs0-dev
  libsensors-config libsensors5 libsm-dev libsm6 libvulkan1 libwayland-client0
  libx11-6 libx11-data libx11-dev libx11-xcb1 libxau-dev libxau6 libxaw7
  libxcb-dri2-0 libxcb-dri3-0 libxcb-glx0 libxcb-present0 libxcb-randr0
  libxcb-shape0 libxcb-sync1 libxcb1 libxcb1-dev libxcomposite1 libxdamage1
  libxdmcp-dev libxdmcp6 libxext6 libxfixes3 libxft2 libxi6 libxinerama1
  libxkbfile1 libxmu6 libxmuu1 libxpm4 libxrandr2 libxrender1 libxshmfence1
  libxt-dev libxt6 libxtst6 libxv1 libxxf86dga1 libxxf86vm1
  mesa-vulkan-drivers openjdk-14-jdk openjdk-14-jdk-headless openjdk-14-jre
  openjdk-14-jre-headless rlwrap shared-mime-info x11-common x11-utils
  x11proto-core-dev x11proto-dev xdg-user-dirs xorg-sgml-doctools xtrans-dev
0 upgraded, 98 newly installed, 0 to remove and 17 not upgraded.
Need to get 341 MB of archives.
After this operation, 872 MB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libglib2.0-0 amd64 2.64.3-1~ubuntu20.04.1 [1,284 kB]
Get:2 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libglib2.0-data all 2.64.3-1~ubuntu20.04.1 [5,752 B]
Get:3 http://archive.ubuntu.com/ubuntu focal/main amd64 shared-mime-info amd64 1.15-1 [430 kB]
Get:4 http://archive.ubuntu.com/ubuntu focal/main amd64 xdg-user-dirs amd64 0.17-2ubuntu1 [48.3 kB]
Get:5 http://archive.ubuntu.com/ubuntu focal/main amd64 libdrm-common all 2.4.101-2 [5,540 B]
Get:6 http://archive.ubuntu.com/ubuntu focal/main amd64 libdrm2 amd64 2.4.101-2 [32.4 kB]
Get:7 http://archive.ubuntu.com/ubuntu focal/main amd64 libxau6 amd64 1:1.0.9-0ubuntu1 [7,488 B]
Get:8 http://archive.ubuntu.com/ubuntu focal/main amd64 libxdmcp6 amd64 1:1.1.3-0ubuntu1 [10.6 kB]
Get:9 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb1 amd64 1.14-2 [44.7 kB]
Get:10 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libx11-data all 2:1.6.9-2ubuntu1.1 [113 kB]
Get:11 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libx11-6 amd64 2:1.6.9-2ubuntu1.1 [574 kB]
Get:12 http://archive.ubuntu.com/ubuntu focal/main amd64 libxext6 amd64 2:1.3.4-0ubuntu1 [29.1 kB]
Get:13 http://archive.ubuntu.com/ubuntu focal/main amd64 libxmuu1 amd64 2:1.1.3-0ubuntu1 [9,728 B]
Get:14 http://archive.ubuntu.com/ubuntu focal/main amd64 libatspi2.0-0 amd64 2.36.0-2 [64.2 kB]
Get:15 http://archive.ubuntu.com/ubuntu focal/main amd64 x11-common all 1:7.7+19ubuntu14 [22.3 kB]
Get:16 http://archive.ubuntu.com/ubuntu focal/main amd64 libxtst6 amd64 2:1.2.3-1 [12.8 kB]
Get:17 http://archive.ubuntu.com/ubuntu focal/main amd64 at-spi2-core amd64 2.36.0-2 [48.7 kB]
Get:18 http://archive.ubuntu.com/ubuntu focal/main amd64 java-common all 0.72 [6,816 B]
Get:19 http://archive.ubuntu.com/ubuntu focal/main amd64 libavahi-common-data amd64 0.7-4ubuntu7 [21.4 kB]
Get:20 http://archive.ubuntu.com/ubuntu focal/main amd64 libavahi-common3 amd64 0.7-4ubuntu7 [21.7 kB]
Get:21 http://archive.ubuntu.com/ubuntu focal/main amd64 libavahi-client3 amd64 0.7-4ubuntu7 [25.5 kB]
Get:22 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libcups2 amd64 2.3.1-9ubuntu1.1 [233 kB]
Get:23 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libjpeg-turbo8 amd64 2.0.3-0ubuntu1.20.04.1 [117 kB]
Get:24 http://archive.ubuntu.com/ubuntu focal/main amd64 libjpeg8 amd64 8c-2ubuntu8 [2,194 B]
Get:25 http://archive.ubuntu.com/ubuntu focal/main amd64 libnspr4 amd64 2:4.25-1 [107 kB]
Get:26 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libnss3 amd64 2:3.49.1-1ubuntu1.5 [1,256 kB]
Get:27 http://archive.ubuntu.com/ubuntu focal/main amd64 libpcsclite1 amd64 1.8.26-3 [22.0 kB]
Get:28 http://archive.ubuntu.com/ubuntu focal/main amd64 libxi6 amd64 2:1.7.10-0ubuntu1 [29.9 kB]
Get:29 http://archive.ubuntu.com/ubuntu focal/main amd64 libxrender1 amd64 1:0.9.10-1 [18.7 kB]
Get:30 http://archive.ubuntu.com/ubuntu focal-updates/universe amd64 openjdk-14-jre-headless amd64 14.0.1+7-1ubuntu1 [44.6 MB]
Get:31 http://archive.ubuntu.com/ubuntu focal/main amd64 ca-certificates-java all 20190405ubuntu1 [12.2 kB]
Get:32 http://archive.ubuntu.com/ubuntu focal/main amd64 fonts-dejavu-extra all 2.37-1 [1,953 kB]
Get:33 http://archive.ubuntu.com/ubuntu focal/main amd64 libatk1.0-data all 2.35.1-1ubuntu2 [2,964 B]
Get:34 http://archive.ubuntu.com/ubuntu focal/main amd64 libatk1.0-0 amd64 2.35.1-1ubuntu2 [45.5 kB]
Get:35 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libatk-bridge2.0-0 amd64 2.34.2-0ubuntu2~20.04.1 [58.2 kB]
Get:36 http://archive.ubuntu.com/ubuntu focal/main amd64 libfontenc1 amd64 1:1.1.4-0ubuntu1 [14.0 kB]
Get:37 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libglvnd0 amd64 1.3.1-1ubuntu0.20.04.1 [49.0 kB]
Get:38 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libglapi-mesa amd64 20.0.8-0ubuntu1~20.04.1 [27.0 kB]
Get:39 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libx11-xcb1 amd64 2:1.6.9-2ubuntu1.1 [9,220 B]
Get:40 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb-dri2-0 amd64 1.14-2 [6,920 B]
Get:41 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb-dri3-0 amd64 1.14-2 [6,552 B]
Get:42 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb-glx0 amd64 1.14-2 [22.1 kB]
Get:43 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb-present0 amd64 1.14-2 [5,560 B]
Get:44 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb-sync1 amd64 1.14-2 [8,884 B]
Get:45 http://archive.ubuntu.com/ubuntu focal/main amd64 libxdamage1 amd64 1:1.1.5-2 [6,996 B]
Get:46 http://archive.ubuntu.com/ubuntu focal/main amd64 libxfixes3 amd64 1:5.0.3-2 [10.9 kB]
Get:47 http://archive.ubuntu.com/ubuntu focal/main amd64 libxshmfence1 amd64 1.3-1 [5,028 B]
Get:48 http://archive.ubuntu.com/ubuntu focal/main amd64 libxxf86vm1 amd64 1:1.1.4-1build1 [10.2 kB]
Get:49 http://archive.ubuntu.com/ubuntu focal/main amd64 libdrm-amdgpu1 amd64 2.4.101-2 [18.3 kB]
Get:50 http://archive.ubuntu.com/ubuntu focal/main amd64 libpciaccess0 amd64 0.16-0ubuntu1 [17.9 kB]
Get:51 http://archive.ubuntu.com/ubuntu focal/main amd64 libdrm-intel1 amd64 2.4.101-2 [60.2 kB]
Get:52 http://archive.ubuntu.com/ubuntu focal/main amd64 libdrm-nouveau2 amd64 2.4.101-2 [16.4 kB]
Get:53 http://archive.ubuntu.com/ubuntu focal/main amd64 libdrm-radeon1 amd64 2.4.101-2 [19.7 kB]
Get:54 http://archive.ubuntu.com/ubuntu focal/main amd64 libllvm10 amd64 1:10.0.0-4ubuntu1 [15.3 MB]
Get:55 http://archive.ubuntu.com/ubuntu focal/main amd64 libsensors-config all 1:3.6.0-2ubuntu1 [6,092 B]
Get:56 http://archive.ubuntu.com/ubuntu focal/main amd64 libsensors5 amd64 1:3.6.0-2ubuntu1 [27.4 kB]
Get:57 http://archive.ubuntu.com/ubuntu focal/main amd64 libvulkan1 amd64 1.2.131.2-1 [93.3 kB]
Get:58 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libgl1-mesa-dri amd64 20.0.8-0ubuntu1~20.04.1 [9,458 kB]
Get:59 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libglx-mesa0 amd64 20.0.8-0ubuntu1~20.04.1 [139 kB]
Get:60 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libglx0 amd64 1.3.1-1ubuntu0.20.04.1 [32.6 kB]
Get:61 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libgl1 amd64 1.3.1-1ubuntu0.20.04.1 [86.5 kB]
Get:62 http://archive.ubuntu.com/ubuntu focal/main amd64 libice6 amd64 2:1.0.10-0ubuntu1 [41.0 kB]
Get:63 http://archive.ubuntu.com/ubuntu focal/main amd64 libsm6 amd64 2:1.2.3-1 [16.1 kB]
Get:64 http://archive.ubuntu.com/ubuntu focal/main amd64 libxt6 amd64 1:1.1.5-1 [160 kB]
Get:65 http://archive.ubuntu.com/ubuntu focal/main amd64 libxmu6 amd64 2:1.1.3-0ubuntu1 [45.8 kB]
Get:66 http://archive.ubuntu.com/ubuntu focal/main amd64 libxpm4 amd64 1:3.5.12-1 [34.0 kB]
Get:67 http://archive.ubuntu.com/ubuntu focal/main amd64 libxaw7 amd64 2:1.0.13-1 [173 kB]
Get:68 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb-shape0 amd64 1.14-2 [5,928 B]
Get:69 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcomposite1 amd64 1:0.4.5-1 [6,976 B]
Get:70 http://archive.ubuntu.com/ubuntu focal/main amd64 libxft2 amd64 2.3.3-0ubuntu1 [39.2 kB]
Get:71 http://archive.ubuntu.com/ubuntu focal/main amd64 libxinerama1 amd64 2:1.1.4-2 [6,904 B]
Get:72 http://archive.ubuntu.com/ubuntu focal/main amd64 libxkbfile1 amd64 1:1.1.0-1 [65.3 kB]
Get:73 http://archive.ubuntu.com/ubuntu focal/main amd64 libxrandr2 amd64 2:1.5.2-0ubuntu1 [18.5 kB]
Get:74 http://archive.ubuntu.com/ubuntu focal/main amd64 libxv1 amd64 2:1.0.11-1 [10.7 kB]
Get:75 http://archive.ubuntu.com/ubuntu focal/main amd64 libxxf86dga1 amd64 2:1.1.5-0ubuntu1 [12.0 kB]
Get:76 http://archive.ubuntu.com/ubuntu focal/main amd64 x11-utils amd64 7.7+5 [199 kB]
Get:77 http://archive.ubuntu.com/ubuntu focal/main amd64 libatk-wrapper-java all 0.37.1-1 [53.0 kB]
Get:78 http://archive.ubuntu.com/ubuntu focal/main amd64 libatk-wrapper-java-jni amd64 0.37.1-1 [45.1 kB]
Get:79 http://archive.ubuntu.com/ubuntu focal/main amd64 libgif7 amd64 5.1.9-1 [32.2 kB]
Get:80 http://archive.ubuntu.com/ubuntu focal/main amd64 xorg-sgml-doctools all 1:1.11-1 [12.9 kB]
Get:81 http://archive.ubuntu.com/ubuntu focal/main amd64 x11proto-dev all 2019.2-1ubuntu1 [594 kB]
Get:82 http://archive.ubuntu.com/ubuntu focal/main amd64 x11proto-core-dev all 2019.2-1ubuntu1 [2,620 B]
Get:83 http://archive.ubuntu.com/ubuntu focal/main amd64 libice-dev amd64 2:1.0.10-0ubuntu1 [47.8 kB]
Get:84 http://archive.ubuntu.com/ubuntu focal/main amd64 libpthread-stubs0-dev amd64 0.4-1 [5,384 B]
Get:85 http://archive.ubuntu.com/ubuntu focal/main amd64 libsm-dev amd64 2:1.2.3-1 [17.0 kB]
Get:86 http://archive.ubuntu.com/ubuntu focal/main amd64 libwayland-client0 amd64 1.18.0-1 [23.9 kB]
Get:87 http://archive.ubuntu.com/ubuntu focal/main amd64 libxau-dev amd64 1:1.0.9-0ubuntu1 [9,552 B]
Get:88 http://archive.ubuntu.com/ubuntu focal/main amd64 libxdmcp-dev amd64 1:1.1.3-0ubuntu1 [25.3 kB]
Get:89 http://archive.ubuntu.com/ubuntu focal/main amd64 xtrans-dev all 1.4.0-1 [68.9 kB]
Get:90 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb1-dev amd64 1.14-2 [80.5 kB]
Get:91 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 libx11-dev amd64 2:1.6.9-2ubuntu1.1 [649 kB]
Get:92 http://archive.ubuntu.com/ubuntu focal/main amd64 libxcb-randr0 amd64 1.14-2 [16.3 kB]
Get:93 http://archive.ubuntu.com/ubuntu focal/main amd64 libxt-dev amd64 1:1.1.5-1 [395 kB]
Get:94 http://archive.ubuntu.com/ubuntu focal-updates/main amd64 mesa-vulkan-drivers amd64 20.0.8-0ubuntu1~20.04.1 [3,349 kB]
Get:95 http://archive.ubuntu.com/ubuntu focal-updates/universe amd64 openjdk-14-jre amd64 14.0.1+7-1ubuntu1 [34.6 kB]
Get:96 http://archive.ubuntu.com/ubuntu focal-updates/universe amd64 openjdk-14-jdk-headless amd64 14.0.1+7-1ubuntu1 [252 MB]
Get:97 http://archive.ubuntu.com/ubuntu focal-updates/universe amd64 openjdk-14-jdk amd64 14.0.1+7-1ubuntu1 [5,158 kB]
Get:98 http://archive.ubuntu.com/ubuntu focal/universe amd64 rlwrap amd64 0.43-1build3 [98.2 kB]
Fetched 341 MB in 19s (18.1 MB/s)
Selecting previously unselected package libglib2.0-0:amd64.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 22115 files and directories currently installed.)
Preparing to unpack .../00-libglib2.0-0_2.64.3-1~ubuntu20.04.1_amd64.deb ...
Unpacking libglib2.0-0:amd64 (2.64.3-1~ubuntu20.04.1) ...
Selecting previously unselected package libglib2.0-data.
Preparing to unpack .../01-libglib2.0-data_2.64.3-1~ubuntu20.04.1_all.deb ...
Unpacking libglib2.0-data (2.64.3-1~ubuntu20.04.1) ...
Selecting previously unselected package shared-mime-info.
Preparing to unpack .../02-shared-mime-info_1.15-1_amd64.deb ...
Unpacking shared-mime-info (1.15-1) ...
Selecting previously unselected package xdg-user-dirs.
Preparing to unpack .../03-xdg-user-dirs_0.17-2ubuntu1_amd64.deb ...
Unpacking xdg-user-dirs (0.17-2ubuntu1) ...
Selecting previously unselected package libdrm-common.
Preparing to unpack .../04-libdrm-common_2.4.101-2_all.deb ...
Unpacking libdrm-common (2.4.101-2) ...
Selecting previously unselected package libdrm2:amd64.
Preparing to unpack .../05-libdrm2_2.4.101-2_amd64.deb ...
Unpacking libdrm2:amd64 (2.4.101-2) ...
Selecting previously unselected package libxau6:amd64.
Preparing to unpack .../06-libxau6_1%3a1.0.9-0ubuntu1_amd64.deb ...
Unpacking libxau6:amd64 (1:1.0.9-0ubuntu1) ...
Selecting previously unselected package libxdmcp6:amd64.
Preparing to unpack .../07-libxdmcp6_1%3a1.1.3-0ubuntu1_amd64.deb ...
Unpacking libxdmcp6:amd64 (1:1.1.3-0ubuntu1) ...
Selecting previously unselected package libxcb1:amd64.
Preparing to unpack .../08-libxcb1_1.14-2_amd64.deb ...
Unpacking libxcb1:amd64 (1.14-2) ...
Selecting previously unselected package libx11-data.
Preparing to unpack .../09-libx11-data_2%3a1.6.9-2ubuntu1.1_all.deb ...
Unpacking libx11-data (2:1.6.9-2ubuntu1.1) ...
Selecting previously unselected package libx11-6:amd64.
Preparing to unpack .../10-libx11-6_2%3a1.6.9-2ubuntu1.1_amd64.deb ...
Unpacking libx11-6:amd64 (2:1.6.9-2ubuntu1.1) ...
Selecting previously unselected package libxext6:amd64.
Preparing to unpack .../11-libxext6_2%3a1.3.4-0ubuntu1_amd64.deb ...
Unpacking libxext6:amd64 (2:1.3.4-0ubuntu1) ...
Selecting previously unselected package libxmuu1:amd64.
Preparing to unpack .../12-libxmuu1_2%3a1.1.3-0ubuntu1_amd64.deb ...
Unpacking libxmuu1:amd64 (2:1.1.3-0ubuntu1) ...
Selecting previously unselected package libatspi2.0-0:amd64.
Preparing to unpack .../13-libatspi2.0-0_2.36.0-2_amd64.deb ...
Unpacking libatspi2.0-0:amd64 (2.36.0-2) ...
Selecting previously unselected package x11-common.
Preparing to unpack .../14-x11-common_1%3a7.7+19ubuntu14_all.deb ...
dpkg-query: no packages found matching nux-tools
Unpacking x11-common (1:7.7+19ubuntu14) ...
Selecting previously unselected package libxtst6:amd64.
Preparing to unpack .../15-libxtst6_2%3a1.2.3-1_amd64.deb ...
Unpacking libxtst6:amd64 (2:1.2.3-1) ...
Selecting previously unselected package at-spi2-core.
Preparing to unpack .../16-at-spi2-core_2.36.0-2_amd64.deb ...
Unpacking at-spi2-core (2.36.0-2) ...
Selecting previously unselected package java-common.
Preparing to unpack .../17-java-common_0.72_all.deb ...
Unpacking java-common (0.72) ...
Selecting previously unselected package libavahi-common-data:amd64.
Preparing to unpack .../18-libavahi-common-data_0.7-4ubuntu7_amd64.deb ...
Unpacking libavahi-common-data:amd64 (0.7-4ubuntu7) ...
Selecting previously unselected package libavahi-common3:amd64.
Preparing to unpack .../19-libavahi-common3_0.7-4ubuntu7_amd64.deb ...
Unpacking libavahi-common3:amd64 (0.7-4ubuntu7) ...
Selecting previously unselected package libavahi-client3:amd64.
Preparing to unpack .../20-libavahi-client3_0.7-4ubuntu7_amd64.deb ...
Unpacking libavahi-client3:amd64 (0.7-4ubuntu7) ...
Selecting previously unselected package libcups2:amd64.
Preparing to unpack .../21-libcups2_2.3.1-9ubuntu1.1_amd64.deb ...
Unpacking libcups2:amd64 (2.3.1-9ubuntu1.1) ...
Selecting previously unselected package libjpeg-turbo8:amd64.
Preparing to unpack .../22-libjpeg-turbo8_2.0.3-0ubuntu1.20.04.1_amd64.deb ...
Unpacking libjpeg-turbo8:amd64 (2.0.3-0ubuntu1.20.04.1) ...
Selecting previously unselected package libjpeg8:amd64.
Preparing to unpack .../23-libjpeg8_8c-2ubuntu8_amd64.deb ...
Unpacking libjpeg8:amd64 (8c-2ubuntu8) ...
Selecting previously unselected package libnspr4:amd64.
Preparing to unpack .../24-libnspr4_2%3a4.25-1_amd64.deb ...
Unpacking libnspr4:amd64 (2:4.25-1) ...
Selecting previously unselected package libnss3:amd64.
Preparing to unpack .../25-libnss3_2%3a3.49.1-1ubuntu1.5_amd64.deb ...
Unpacking libnss3:amd64 (2:3.49.1-1ubuntu1.5) ...
Selecting previously unselected package libpcsclite1:amd64.
Preparing to unpack .../26-libpcsclite1_1.8.26-3_amd64.deb ...
Unpacking libpcsclite1:amd64 (1.8.26-3) ...
Selecting previously unselected package libxi6:amd64.
Preparing to unpack .../27-libxi6_2%3a1.7.10-0ubuntu1_amd64.deb ...
Unpacking libxi6:amd64 (2:1.7.10-0ubuntu1) ...
Selecting previously unselected package libxrender1:amd64.
Preparing to unpack .../28-libxrender1_1%3a0.9.10-1_amd64.deb ...
Unpacking libxrender1:amd64 (1:0.9.10-1) ...
Selecting previously unselected package openjdk-14-jre-headless:amd64.
Preparing to unpack .../29-openjdk-14-jre-headless_14.0.1+7-1ubuntu1_amd64.deb ...
Unpacking openjdk-14-jre-headless:amd64 (14.0.1+7-1ubuntu1) ...
Selecting previously unselected package ca-certificates-java.
Preparing to unpack .../30-ca-certificates-java_20190405ubuntu1_all.deb ...
Unpacking ca-certificates-java (20190405ubuntu1) ...
Selecting previously unselected package fonts-dejavu-extra.
Preparing to unpack .../31-fonts-dejavu-extra_2.37-1_all.deb ...
Unpacking fonts-dejavu-extra (2.37-1) ...
Selecting previously unselected package libatk1.0-data.
Preparing to unpack .../32-libatk1.0-data_2.35.1-1ubuntu2_all.deb ...
Unpacking libatk1.0-data (2.35.1-1ubuntu2) ...
Selecting previously unselected package libatk1.0-0:amd64.
Preparing to unpack .../33-libatk1.0-0_2.35.1-1ubuntu2_amd64.deb ...
Unpacking libatk1.0-0:amd64 (2.35.1-1ubuntu2) ...
Selecting previously unselected package libatk-bridge2.0-0:amd64.
Preparing to unpack .../34-libatk-bridge2.0-0_2.34.2-0ubuntu2~20.04.1_amd64.deb ...
Unpacking libatk-bridge2.0-0:amd64 (2.34.2-0ubuntu2~20.04.1) ...
Selecting previously unselected package libfontenc1:amd64.
Preparing to unpack .../35-libfontenc1_1%3a1.1.4-0ubuntu1_amd64.deb ...
Unpacking libfontenc1:amd64 (1:1.1.4-0ubuntu1) ...
Selecting previously unselected package libglvnd0:amd64.
Preparing to unpack .../36-libglvnd0_1.3.1-1ubuntu0.20.04.1_amd64.deb ...
Unpacking libglvnd0:amd64 (1.3.1-1ubuntu0.20.04.1) ...
Selecting previously unselected package libglapi-mesa:amd64.
Preparing to unpack .../37-libglapi-mesa_20.0.8-0ubuntu1~20.04.1_amd64.deb ...
Unpacking libglapi-mesa:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Selecting previously unselected package libx11-xcb1:amd64.
Preparing to unpack .../38-libx11-xcb1_2%3a1.6.9-2ubuntu1.1_amd64.deb ...
Unpacking libx11-xcb1:amd64 (2:1.6.9-2ubuntu1.1) ...
Selecting previously unselected package libxcb-dri2-0:amd64.
Preparing to unpack .../39-libxcb-dri2-0_1.14-2_amd64.deb ...
Unpacking libxcb-dri2-0:amd64 (1.14-2) ...
Selecting previously unselected package libxcb-dri3-0:amd64.
Preparing to unpack .../40-libxcb-dri3-0_1.14-2_amd64.deb ...
Unpacking libxcb-dri3-0:amd64 (1.14-2) ...
Selecting previously unselected package libxcb-glx0:amd64.
Preparing to unpack .../41-libxcb-glx0_1.14-2_amd64.deb ...
Unpacking libxcb-glx0:amd64 (1.14-2) ...
Selecting previously unselected package libxcb-present0:amd64.
Preparing to unpack .../42-libxcb-present0_1.14-2_amd64.deb ...
Unpacking libxcb-present0:amd64 (1.14-2) ...
Selecting previously unselected package libxcb-sync1:amd64.
Preparing to unpack .../43-libxcb-sync1_1.14-2_amd64.deb ...
Unpacking libxcb-sync1:amd64 (1.14-2) ...
Selecting previously unselected package libxdamage1:amd64.
Preparing to unpack .../44-libxdamage1_1%3a1.1.5-2_amd64.deb ...
Unpacking libxdamage1:amd64 (1:1.1.5-2) ...
Selecting previously unselected package libxfixes3:amd64.
Preparing to unpack .../45-libxfixes3_1%3a5.0.3-2_amd64.deb ...
Unpacking libxfixes3:amd64 (1:5.0.3-2) ...
Selecting previously unselected package libxshmfence1:amd64.
Preparing to unpack .../46-libxshmfence1_1.3-1_amd64.deb ...
Unpacking libxshmfence1:amd64 (1.3-1) ...
Selecting previously unselected package libxxf86vm1:amd64.
Preparing to unpack .../47-libxxf86vm1_1%3a1.1.4-1build1_amd64.deb ...
Unpacking libxxf86vm1:amd64 (1:1.1.4-1build1) ...
Selecting previously unselected package libdrm-amdgpu1:amd64.
Preparing to unpack .../48-libdrm-amdgpu1_2.4.101-2_amd64.deb ...
Unpacking libdrm-amdgpu1:amd64 (2.4.101-2) ...
Selecting previously unselected package libpciaccess0:amd64.
Preparing to unpack .../49-libpciaccess0_0.16-0ubuntu1_amd64.deb ...
Unpacking libpciaccess0:amd64 (0.16-0ubuntu1) ...
Selecting previously unselected package libdrm-intel1:amd64.
Preparing to unpack .../50-libdrm-intel1_2.4.101-2_amd64.deb ...
Unpacking libdrm-intel1:amd64 (2.4.101-2) ...
Selecting previously unselected package libdrm-nouveau2:amd64.
Preparing to unpack .../51-libdrm-nouveau2_2.4.101-2_amd64.deb ...
Unpacking libdrm-nouveau2:amd64 (2.4.101-2) ...
Selecting previously unselected package libdrm-radeon1:amd64.
Preparing to unpack .../52-libdrm-radeon1_2.4.101-2_amd64.deb ...
Unpacking libdrm-radeon1:amd64 (2.4.101-2) ...
Selecting previously unselected package libllvm10:amd64.
Preparing to unpack .../53-libllvm10_1%3a10.0.0-4ubuntu1_amd64.deb ...
Unpacking libllvm10:amd64 (1:10.0.0-4ubuntu1) ...
Selecting previously unselected package libsensors-config.
Preparing to unpack .../54-libsensors-config_1%3a3.6.0-2ubuntu1_all.deb ...
Unpacking libsensors-config (1:3.6.0-2ubuntu1) ...
Selecting previously unselected package libsensors5:amd64.
Preparing to unpack .../55-libsensors5_1%3a3.6.0-2ubuntu1_amd64.deb ...
Unpacking libsensors5:amd64 (1:3.6.0-2ubuntu1) ...
Selecting previously unselected package libvulkan1:amd64.
Preparing to unpack .../56-libvulkan1_1.2.131.2-1_amd64.deb ...
Unpacking libvulkan1:amd64 (1.2.131.2-1) ...
Selecting previously unselected package libgl1-mesa-dri:amd64.
Preparing to unpack .../57-libgl1-mesa-dri_20.0.8-0ubuntu1~20.04.1_amd64.deb ...
Unpacking libgl1-mesa-dri:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Selecting previously unselected package libglx-mesa0:amd64.
Preparing to unpack .../58-libglx-mesa0_20.0.8-0ubuntu1~20.04.1_amd64.deb ...
Unpacking libglx-mesa0:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Selecting previously unselected package libglx0:amd64.
Preparing to unpack .../59-libglx0_1.3.1-1ubuntu0.20.04.1_amd64.deb ...
Unpacking libglx0:amd64 (1.3.1-1ubuntu0.20.04.1) ...
Selecting previously unselected package libgl1:amd64.
Preparing to unpack .../60-libgl1_1.3.1-1ubuntu0.20.04.1_amd64.deb ...
Unpacking libgl1:amd64 (1.3.1-1ubuntu0.20.04.1) ...
Selecting previously unselected package libice6:amd64.
Preparing to unpack .../61-libice6_2%3a1.0.10-0ubuntu1_amd64.deb ...
Unpacking libice6:amd64 (2:1.0.10-0ubuntu1) ...
Selecting previously unselected package libsm6:amd64.
Preparing to unpack .../62-libsm6_2%3a1.2.3-1_amd64.deb ...
Unpacking libsm6:amd64 (2:1.2.3-1) ...
Selecting previously unselected package libxt6:amd64.
Preparing to unpack .../63-libxt6_1%3a1.1.5-1_amd64.deb ...
Unpacking libxt6:amd64 (1:1.1.5-1) ...
Selecting previously unselected package libxmu6:amd64.
Preparing to unpack .../64-libxmu6_2%3a1.1.3-0ubuntu1_amd64.deb ...
Unpacking libxmu6:amd64 (2:1.1.3-0ubuntu1) ...
Selecting previously unselected package libxpm4:amd64.
Preparing to unpack .../65-libxpm4_1%3a3.5.12-1_amd64.deb ...
Unpacking libxpm4:amd64 (1:3.5.12-1) ...
Selecting previously unselected package libxaw7:amd64.
Preparing to unpack .../66-libxaw7_2%3a1.0.13-1_amd64.deb ...
Unpacking libxaw7:amd64 (2:1.0.13-1) ...
Selecting previously unselected package libxcb-shape0:amd64.
Preparing to unpack .../67-libxcb-shape0_1.14-2_amd64.deb ...
Unpacking libxcb-shape0:amd64 (1.14-2) ...
Selecting previously unselected package libxcomposite1:amd64.
Preparing to unpack .../68-libxcomposite1_1%3a0.4.5-1_amd64.deb ...
Unpacking libxcomposite1:amd64 (1:0.4.5-1) ...
Selecting previously unselected package libxft2:amd64.
Preparing to unpack .../69-libxft2_2.3.3-0ubuntu1_amd64.deb ...
Unpacking libxft2:amd64 (2.3.3-0ubuntu1) ...
Selecting previously unselected package libxinerama1:amd64.
Preparing to unpack .../70-libxinerama1_2%3a1.1.4-2_amd64.deb ...
Unpacking libxinerama1:amd64 (2:1.1.4-2) ...
Selecting previously unselected package libxkbfile1:amd64.
Preparing to unpack .../71-libxkbfile1_1%3a1.1.0-1_amd64.deb ...
Unpacking libxkbfile1:amd64 (1:1.1.0-1) ...
Selecting previously unselected package libxrandr2:amd64.
Preparing to unpack .../72-libxrandr2_2%3a1.5.2-0ubuntu1_amd64.deb ...
Unpacking libxrandr2:amd64 (2:1.5.2-0ubuntu1) ...
Selecting previously unselected package libxv1:amd64.
Preparing to unpack .../73-libxv1_2%3a1.0.11-1_amd64.deb ...
Unpacking libxv1:amd64 (2:1.0.11-1) ...
Selecting previously unselected package libxxf86dga1:amd64.
Preparing to unpack .../74-libxxf86dga1_2%3a1.1.5-0ubuntu1_amd64.deb ...
Unpacking libxxf86dga1:amd64 (2:1.1.5-0ubuntu1) ...
Selecting previously unselected package x11-utils.
Preparing to unpack .../75-x11-utils_7.7+5_amd64.deb ...
Unpacking x11-utils (7.7+5) ...
Selecting previously unselected package libatk-wrapper-java.
Preparing to unpack .../76-libatk-wrapper-java_0.37.1-1_all.deb ...
Unpacking libatk-wrapper-java (0.37.1-1) ...
Selecting previously unselected package libatk-wrapper-java-jni:amd64.
Preparing to unpack .../77-libatk-wrapper-java-jni_0.37.1-1_amd64.deb ...
Unpacking libatk-wrapper-java-jni:amd64 (0.37.1-1) ...
Selecting previously unselected package libgif7:amd64.
Preparing to unpack .../78-libgif7_5.1.9-1_amd64.deb ...
Unpacking libgif7:amd64 (5.1.9-1) ...
Selecting previously unselected package xorg-sgml-doctools.
Preparing to unpack .../79-xorg-sgml-doctools_1%3a1.11-1_all.deb ...
Unpacking xorg-sgml-doctools (1:1.11-1) ...
Selecting previously unselected package x11proto-dev.
Preparing to unpack .../80-x11proto-dev_2019.2-1ubuntu1_all.deb ...
Unpacking x11proto-dev (2019.2-1ubuntu1) ...
Selecting previously unselected package x11proto-core-dev.
Preparing to unpack .../81-x11proto-core-dev_2019.2-1ubuntu1_all.deb ...
Unpacking x11proto-core-dev (2019.2-1ubuntu1) ...
Selecting previously unselected package libice-dev:amd64.
Preparing to unpack .../82-libice-dev_2%3a1.0.10-0ubuntu1_amd64.deb ...
Unpacking libice-dev:amd64 (2:1.0.10-0ubuntu1) ...
Selecting previously unselected package libpthread-stubs0-dev:amd64.
Preparing to unpack .../83-libpthread-stubs0-dev_0.4-1_amd64.deb ...
Unpacking libpthread-stubs0-dev:amd64 (0.4-1) ...
Selecting previously unselected package libsm-dev:amd64.
Preparing to unpack .../84-libsm-dev_2%3a1.2.3-1_amd64.deb ...
Unpacking libsm-dev:amd64 (2:1.2.3-1) ...
Selecting previously unselected package libwayland-client0:amd64.
Preparing to unpack .../85-libwayland-client0_1.18.0-1_amd64.deb ...
Unpacking libwayland-client0:amd64 (1.18.0-1) ...
Selecting previously unselected package libxau-dev:amd64.
Preparing to unpack .../86-libxau-dev_1%3a1.0.9-0ubuntu1_amd64.deb ...
Unpacking libxau-dev:amd64 (1:1.0.9-0ubuntu1) ...
Selecting previously unselected package libxdmcp-dev:amd64.
Preparing to unpack .../87-libxdmcp-dev_1%3a1.1.3-0ubuntu1_amd64.deb ...
Unpacking libxdmcp-dev:amd64 (1:1.1.3-0ubuntu1) ...
Selecting previously unselected package xtrans-dev.
Preparing to unpack .../88-xtrans-dev_1.4.0-1_all.deb ...
Unpacking xtrans-dev (1.4.0-1) ...
Selecting previously unselected package libxcb1-dev:amd64.
Preparing to unpack .../89-libxcb1-dev_1.14-2_amd64.deb ...
Unpacking libxcb1-dev:amd64 (1.14-2) ...
Selecting previously unselected package libx11-dev:amd64.
Preparing to unpack .../90-libx11-dev_2%3a1.6.9-2ubuntu1.1_amd64.deb ...
Unpacking libx11-dev:amd64 (2:1.6.9-2ubuntu1.1) ...
Selecting previously unselected package libxcb-randr0:amd64.
Preparing to unpack .../91-libxcb-randr0_1.14-2_amd64.deb ...
Unpacking libxcb-randr0:amd64 (1.14-2) ...
Selecting previously unselected package libxt-dev:amd64.
Preparing to unpack .../92-libxt-dev_1%3a1.1.5-1_amd64.deb ...
Unpacking libxt-dev:amd64 (1:1.1.5-1) ...
Selecting previously unselected package mesa-vulkan-drivers:amd64.
Preparing to unpack .../93-mesa-vulkan-drivers_20.0.8-0ubuntu1~20.04.1_amd64.deb ...
Unpacking mesa-vulkan-drivers:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Selecting previously unselected package openjdk-14-jre:amd64.
Preparing to unpack .../94-openjdk-14-jre_14.0.1+7-1ubuntu1_amd64.deb ...
Unpacking openjdk-14-jre:amd64 (14.0.1+7-1ubuntu1) ...
Selecting previously unselected package openjdk-14-jdk-headless:amd64.
Preparing to unpack .../95-openjdk-14-jdk-headless_14.0.1+7-1ubuntu1_amd64.deb ...
Unpacking openjdk-14-jdk-headless:amd64 (14.0.1+7-1ubuntu1) ...
Selecting previously unselected package openjdk-14-jdk:amd64.
Preparing to unpack .../96-openjdk-14-jdk_14.0.1+7-1ubuntu1_amd64.deb ...
Unpacking openjdk-14-jdk:amd64 (14.0.1+7-1ubuntu1) ...
Selecting previously unselected package rlwrap.
Preparing to unpack .../97-rlwrap_0.43-1build3_amd64.deb ...
Unpacking rlwrap (0.43-1build3) ...
Setting up libx11-xcb1:amd64 (2:1.6.9-2ubuntu1.1) ...
Setting up libpciaccess0:amd64 (0.16-0ubuntu1) ...
Setting up libxau6:amd64 (1:1.0.9-0ubuntu1) ...
Setting up libxdmcp6:amd64 (1:1.1.3-0ubuntu1) ...
Setting up libxcb1:amd64 (1.14-2) ...
Setting up java-common (0.72) ...
Setting up xdg-user-dirs (0.17-2ubuntu1) ...
Setting up libglib2.0-0:amd64 (2.64.3-1~ubuntu20.04.1) ...
No schema files found: doing nothing.
Setting up libglvnd0:amd64 (1.3.1-1ubuntu0.20.04.1) ...
Setting up libxcb-glx0:amd64 (1.14-2) ...
Setting up libxcb-shape0:amd64 (1.14-2) ...
Setting up x11-common (1:7.7+19ubuntu14) ...
debconf: unable to initialize frontend: Dialog
debconf: (Dialog frontend will not work on a dumb terminal, an emacs shell buffer, or without a controlling terminal.)
debconf: falling back to frontend: Readline
update-rc.d: warning: start and stop actions are no longer supported; falling back to defaults
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up libsensors-config (1:3.6.0-2ubuntu1) ...
Setting up libpthread-stubs0-dev:amd64 (0.4-1) ...
Setting up libllvm10:amd64 (1:10.0.0-4ubuntu1) ...
Setting up libxcb-present0:amd64 (1.14-2) ...
Setting up xtrans-dev (1.4.0-1) ...
Setting up libfontenc1:amd64 (1:1.1.4-0ubuntu1) ...
Setting up libglib2.0-data (2.64.3-1~ubuntu20.04.1) ...
Setting up libx11-data (2:1.6.9-2ubuntu1.1) ...
Setting up libnspr4:amd64 (2:4.25-1) ...
Setting up libxcb-sync1:amd64 (1.14-2) ...
Setting up libavahi-common-data:amd64 (0.7-4ubuntu7) ...
Setting up rlwrap (0.43-1build3) ...
update-alternatives: using /usr/bin/rlwrap to provide /usr/bin/readline-editor (readline-editor) in auto mode
update-alternatives: warning: skip creation of /usr/share/man/man1/readline-editor.1.gz because associated file /usr/share/man/man1/rlwrap.1.gz (of link group readline-editor) doesn't exist
Setting up shared-mime-info (1.15-1) ...
Setting up libpcsclite1:amd64 (1.8.26-3) ...
Setting up libsensors5:amd64 (1:3.6.0-2ubuntu1) ...
Setting up libjpeg-turbo8:amd64 (2.0.3-0ubuntu1.20.04.1) ...
Setting up libglapi-mesa:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Setting up libvulkan1:amd64 (1.2.131.2-1) ...
Setting up libxcb-dri2-0:amd64 (1.14-2) ...
Setting up libgif7:amd64 (5.1.9-1) ...
Setting up libatk1.0-data (2.35.1-1ubuntu2) ...
Setting up fonts-dejavu-extra (2.37-1) ...
Setting up libxshmfence1:amd64 (1.3-1) ...
Setting up libxcb-randr0:amd64 (1.14-2) ...
Setting up libx11-6:amd64 (2:1.6.9-2ubuntu1.1) ...
Setting up xorg-sgml-doctools (1:1.11-1) ...
Setting up libatk1.0-0:amd64 (2.35.1-1ubuntu2) ...
Setting up libxkbfile1:amd64 (1:1.1.0-1) ...
Setting up libdrm-common (2.4.101-2) ...
Setting up libxcomposite1:amd64 (1:0.4.5-1) ...
Setting up libxmuu1:amd64 (2:1.1.3-0ubuntu1) ...
Setting up libwayland-client0:amd64 (1.18.0-1) ...
Setting up libjpeg8:amd64 (8c-2ubuntu8) ...
Setting up x11proto-dev (2019.2-1ubuntu1) ...
Setting up libxcb-dri3-0:amd64 (1.14-2) ...
Setting up libice6:amd64 (2:1.0.10-0ubuntu1) ...
Setting up libxdamage1:amd64 (1:1.1.5-2) ...
Setting up libxau-dev:amd64 (1:1.0.9-0ubuntu1) ...
Setting up libxpm4:amd64 (1:3.5.12-1) ...
Setting up libxrender1:amd64 (1:0.9.10-1) ...
Setting up libice-dev:amd64 (2:1.0.10-0ubuntu1) ...
Setting up libavahi-common3:amd64 (0.7-4ubuntu7) ...
Setting up libxext6:amd64 (2:1.3.4-0ubuntu1) ...
Setting up libnss3:amd64 (2:3.49.1-1ubuntu1.5) ...
Setting up libatspi2.0-0:amd64 (2.36.0-2) ...
Setting up libxxf86vm1:amd64 (1:1.1.4-1build1) ...
Setting up libatk-bridge2.0-0:amd64 (2.34.2-0ubuntu2~20.04.1) ...
Setting up libxdmcp-dev:amd64 (1:1.1.3-0ubuntu1) ...
Setting up libxfixes3:amd64 (1:5.0.3-2) ...
Setting up x11proto-core-dev (2019.2-1ubuntu1) ...
Setting up libxinerama1:amd64 (2:1.1.4-2) ...
Setting up libxv1:amd64 (2:1.0.11-1) ...
Setting up libxrandr2:amd64 (2:1.5.2-0ubuntu1) ...
Setting up libdrm2:amd64 (2.4.101-2) ...
Setting up libsm6:amd64 (2:1.2.3-1) ...
Setting up libavahi-client3:amd64 (0.7-4ubuntu7) ...
Setting up libdrm-amdgpu1:amd64 (2.4.101-2) ...
Setting up mesa-vulkan-drivers:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Setting up libxft2:amd64 (2.3.3-0ubuntu1) ...
Setting up libdrm-nouveau2:amd64 (2.4.101-2) ...
Setting up libxcb1-dev:amd64 (1.14-2) ...
Setting up libxi6:amd64 (2:1.7.10-0ubuntu1) ...
Setting up libsm-dev:amd64 (2:1.2.3-1) ...
Setting up libdrm-radeon1:amd64 (2.4.101-2) ...
Setting up libxtst6:amd64 (2:1.2.3-1) ...
Setting up libdrm-intel1:amd64 (2.4.101-2) ...
Setting up libgl1-mesa-dri:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Setting up libxxf86dga1:amd64 (2:1.1.5-0ubuntu1) ...
Setting up libx11-dev:amd64 (2:1.6.9-2ubuntu1.1) ...
Setting up libxt6:amd64 (1:1.1.5-1) ...
Setting up libcups2:amd64 (2.3.1-9ubuntu1.1) ...
Setting up at-spi2-core (2.36.0-2) ...
Setting up libxmu6:amd64 (2:1.1.3-0ubuntu1) ...
Setting up libglx-mesa0:amd64 (20.0.8-0ubuntu1~20.04.1) ...
Setting up libglx0:amd64 (1.3.1-1ubuntu0.20.04.1) ...
Setting up libxaw7:amd64 (2:1.0.13-1) ...
Setting up libgl1:amd64 (1.3.1-1ubuntu0.20.04.1) ...
Setting up libxt-dev:amd64 (1:1.1.5-1) ...
Setting up x11-utils (7.7+5) ...
Setting up libatk-wrapper-java (0.37.1-1) ...
Setting up libatk-wrapper-java-jni:amd64 (0.37.1-1) ...
Setting up ca-certificates-java (20190405ubuntu1) ...
head: cannot open '/etc/ssl/certs/java/cacerts' for reading: No such file or directory
Adding debian:COMODO_Certification_Authority.pem
Adding debian:SSL.com_Root_Certification_Authority_RSA.pem
Adding debian:USERTrust_RSA_Certification_Authority.pem
Adding debian:SSL.com_Root_Certification_Authority_ECC.pem
Adding debian:CFCA_EV_ROOT.pem
Adding debian:Entrust_Root_Certification_Authority.pem
Adding debian:VeriSign_Class_3_Public_Primary_Certification_Authority_-_G5.pem
Adding debian:USERTrust_ECC_Certification_Authority.pem
Adding debian:QuoVadis_Root_CA.pem
Adding debian:QuoVadis_Root_CA_1_G3.pem
Adding debian:ePKI_Root_Certification_Authority.pem
Adding debian:DigiCert_Assured_ID_Root_G3.pem
Adding debian:Starfield_Root_Certificate_Authority_-_G2.pem
Adding debian:SecureTrust_CA.pem
Adding debian:Amazon_Root_CA_3.pem
Adding debian:Chambers_of_Commerce_Root_-_2008.pem
Adding debian:VeriSign_Class_3_Public_Primary_Certification_Authority_-_G4.pem
Adding debian:DST_Root_CA_X3.pem
Adding debian:Amazon_Root_CA_4.pem
Adding debian:Atos_TrustedRoot_2011.pem
Adding debian:Hellenic_Academic_and_Research_Institutions_RootCA_2015.pem
Adding debian:GeoTrust_Universal_CA.pem
Adding debian:Certum_Trusted_Network_CA_2.pem
Adding debian:Starfield_Class_2_CA.pem
Adding debian:AffirmTrust_Premium.pem
Adding debian:GeoTrust_Universal_CA_2.pem
Adding debian:D-TRUST_Root_Class_3_CA_2_2009.pem
Adding debian:T-TeleSec_GlobalRoot_Class_3.pem
Adding debian:Deutsche_Telekom_Root_CA_2.pem
Adding debian:TrustCor_RootCert_CA-2.pem
Adding debian:Global_Chambersign_Root_-_2008.pem
Adding debian:Entrust_Root_Certification_Authority_-_G2.pem
Adding debian:Amazon_Root_CA_2.pem
Adding debian:Buypass_Class_2_Root_CA.pem
Adding debian:thawte_Primary_Root_CA.pem
Adding debian:Trustis_FPS_Root_CA.pem
Adding debian:DigiCert_Assured_ID_Root_CA.pem
Adding debian:TWCA_Global_Root_CA.pem
Adding debian:COMODO_ECC_Certification_Authority.pem
Adding debian:E-Tugra_Certification_Authority.pem
Adding debian:Certigna.pem
Adding debian:LuxTrust_Global_Root_2.pem
Adding debian:OISTE_WISeKey_Global_Root_GB_CA.pem
Adding debian:COMODO_RSA_Certification_Authority.pem
Adding debian:Sonera_Class_2_Root_CA.pem
Adding debian:Autoridad_de_Certificacion_Firmaprofesional_CIF_A62634068.pem
Adding debian:TUBITAK_Kamu_SM_SSL_Kok_Sertifikasi_-_Surum_1.pem
Adding debian:thawte_Primary_Root_CA_-_G2.pem
Adding debian:GlobalSign_Root_CA.pem
Adding debian:GlobalSign_Root_CA_-_R3.pem
Adding debian:Entrust_Root_Certification_Authority_-_EC1.pem
Adding debian:Actalis_Authentication_Root_CA.pem
Adding debian:IdenTrust_Public_Sector_Root_CA_1.pem
Adding debian:DigiCert_Assured_ID_Root_G2.pem
Adding debian:SwissSign_Gold_CA_-_G2.pem
Adding debian:GlobalSign_Root_CA_-_R6.pem
Adding debian:TrustCor_RootCert_CA-1.pem
Adding debian:Security_Communication_Root_CA.pem
Adding debian:TWCA_Root_Certification_Authority.pem
Adding debian:GlobalSign_ECC_Root_CA_-_R4.pem
Adding debian:ISRG_Root_X1.pem
Adding debian:GlobalSign_ECC_Root_CA_-_R5.pem
Adding debian:GeoTrust_Primary_Certification_Authority.pem
Adding debian:Staat_der_Nederlanden_EV_Root_CA.pem
Adding debian:Entrust.net_Premium_2048_Secure_Server_CA.pem
Adding debian:Hongkong_Post_Root_CA_1.pem
Adding debian:Hellenic_Academic_and_Research_Institutions_RootCA_2011.pem
Adding debian:CA_Disig_Root_R2.pem
Adding debian:Certinomis_-_Root_CA.pem
Adding debian:AffirmTrust_Networking.pem
Adding debian:Security_Communication_RootCA2.pem
Adding debian:D-TRUST_Root_Class_3_CA_2_EV_2009.pem
Adding debian:GlobalSign_Root_CA_-_R2.pem
Adding debian:SecureSign_RootCA11.pem
Adding debian:DigiCert_Trusted_Root_G4.pem
Adding debian:Amazon_Root_CA_1.pem
Adding debian:DigiCert_Global_Root_CA.pem
Adding debian:Buypass_Class_3_Root_CA.pem
Adding debian:DigiCert_Global_Root_G3.pem
Adding debian:ACCVRAIZ1.pem
Adding debian:TeliaSonera_Root_CA_v1.pem
Adding debian:VeriSign_Universal_Root_Certification_Authority.pem
Adding debian:EE_Certification_Centre_Root_CA.pem
Adding debian:AffirmTrust_Commercial.pem
Adding debian:AC_RAIZ_FNMT-RCM.pem
Adding debian:certSIGN_ROOT_CA.pem
Adding debian:T-TeleSec_GlobalRoot_Class_2.pem
Adding debian:IdenTrust_Commercial_Root_CA_1.pem
Adding debian:Staat_der_Nederlanden_Root_CA_-_G3.pem
Adding debian:SwissSign_Silver_CA_-_G2.pem
Adding debian:QuoVadis_Root_CA_2.pem
Adding debian:Staat_der_Nederlanden_Root_CA_-_G2.pem
Adding debian:GeoTrust_Global_CA.pem
Adding debian:Hellenic_Academic_and_Research_Institutions_ECC_RootCA_2015.pem
Adding debian:Secure_Global_CA.pem
Adding debian:Go_Daddy_Root_Certificate_Authority_-_G2.pem
Adding debian:thawte_Primary_Root_CA_-_G3.pem
Adding debian:OISTE_WISeKey_Global_Root_GA_CA.pem
Adding debian:GDCA_TrustAUTH_R5_ROOT.pem
Adding debian:DigiCert_Global_Root_G2.pem
Adding debian:Taiwan_GRCA.pem
Adding debian:TrustCor_ECA-1.pem
Adding debian:Certum_Trusted_Network_CA.pem
Adding debian:SSL.com_EV_Root_Certification_Authority_ECC.pem
Adding debian:DigiCert_High_Assurance_EV_Root_CA.pem
Adding debian:Comodo_AAA_Services_root.pem
Adding debian:GeoTrust_Primary_Certification_Authority_-_G2.pem
Adding debian:Verisign_Class_3_Public_Primary_Certification_Authority_-_G3.pem
Adding debian:SSL.com_EV_Root_Certification_Authority_RSA_R2.pem
Adding debian:GeoTrust_Primary_Certification_Authority_-_G3.pem
Adding debian:QuoVadis_Root_CA_3_G3.pem
Adding debian:Izenpe.com.pem
Adding debian:AffirmTrust_Premium_ECC.pem
Adding debian:OISTE_WISeKey_Global_Root_GC_CA.pem
Adding debian:Microsec_e-Szigno_Root_CA_2009.pem
Adding debian:Network_Solutions_Certificate_Authority.pem
Adding debian:XRamp_Global_CA_Root.pem
Adding debian:Starfield_Services_Root_Certificate_Authority_-_G2.pem
Adding debian:Certplus_Class_2_Primary_CA.pem
Adding debian:NetLock_Arany_=Class_Gold=_Főtanúsítvány.pem
Adding debian:Go_Daddy_Class_2_CA.pem
Adding debian:QuoVadis_Root_CA_2_G3.pem
Adding debian:Baltimore_CyberTrust_Root.pem
Adding debian:EC-ACC.pem
Adding debian:Cybertrust_Global_Root.pem
Adding debian:QuoVadis_Root_CA_3.pem
Adding debian:SZAFIR_ROOT_CA2.pem
done.
Processing triggers for fontconfig (2.13.1-2ubuntu3) ...
Processing triggers for mime-support (3.64ubuntu1) ...
Processing triggers for libc-bin (2.31-0ubuntu9) ...
Processing triggers for ca-certificates (20190110ubuntu1.1) ...
Updating certificates in /etc/ssl/certs...
0 added, 0 removed; done.
Running hooks in /etc/ca-certificates/update.d...

/etc/ca-certificates/update.d/jks-keystore: 82: java: not found
E: /etc/ca-certificates/update.d/jks-keystore exited with code 1.
done.
Setting up openjdk-14-jre-headless:amd64 (14.0.1+7-1ubuntu1) ...
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/rmid to provide /usr/bin/rmid (rmid) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jpackage to provide /usr/bin/jpackage (jpackage) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/java to provide /usr/bin/java (java) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/keytool to provide /usr/bin/keytool (keytool) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jjs to provide /usr/bin/jjs (jjs) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/rmiregistry to provide /usr/bin/rmiregistry (rmiregistry) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jfr to provide /usr/bin/jfr (jfr) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/lib/jexec to provide /usr/bin/jexec (jexec) in auto mode
Setting up openjdk-14-jre:amd64 (14.0.1+7-1ubuntu1) ...
Setting up openjdk-14-jdk-headless:amd64 (14.0.1+7-1ubuntu1) ...
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jar to provide /usr/bin/jar (jar) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jarsigner to provide /usr/bin/jarsigner (jarsigner) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/javac to provide /usr/bin/javac (javac) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/javadoc to provide /usr/bin/javadoc (javadoc) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/javap to provide /usr/bin/javap (javap) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jcmd to provide /usr/bin/jcmd (jcmd) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jdb to provide /usr/bin/jdb (jdb) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jdeprscan to provide /usr/bin/jdeprscan (jdeprscan) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jdeps to provide /usr/bin/jdeps (jdeps) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jimage to provide /usr/bin/jimage (jimage) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jinfo to provide /usr/bin/jinfo (jinfo) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jlink to provide /usr/bin/jlink (jlink) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jmap to provide /usr/bin/jmap (jmap) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jmod to provide /usr/bin/jmod (jmod) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jps to provide /usr/bin/jps (jps) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jrunscript to provide /usr/bin/jrunscript (jrunscript) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jshell to provide /usr/bin/jshell (jshell) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jstack to provide /usr/bin/jstack (jstack) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jstat to provide /usr/bin/jstat (jstat) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jstatd to provide /usr/bin/jstatd (jstatd) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/rmic to provide /usr/bin/rmic (rmic) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/serialver to provide /usr/bin/serialver (serialver) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jaotc to provide /usr/bin/jaotc (jaotc) in auto mode
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jhsdb to provide /usr/bin/jhsdb (jhsdb) in auto mode
Setting up openjdk-14-jdk:amd64 (14.0.1+7-1ubuntu1) ...
update-alternatives: using /usr/lib/jvm/java-14-openjdk-amd64/bin/jconsole to provide /usr/bin/jconsole (jconsole) in auto mode
#+end_example

** Extras

Install lein
#+begin_src shell :results silent
  curl -OL -o lein https://raw.githubusercontent.com/technomancy/leiningen/stable/bin/lein
  chmod +x lein
  sudo mv lein /usr/local/bin/lein
  lein || true
#+end_src

Install clojure
#+begin_src shell :results silent
  curl -O https://download.clojure.org/install/linux-install-1.10.1.697.sh
  chmod +x linux-install-1.10.1.697.sh
  sudo ./linux-install-1.10.1.697.sh
  rm ./linux-install-1.10.1.697.sh
#+end_src

* Map to Ingress in-cluster

Create a Kubernetes Service resource into Humacs, to route traffic to pair
#+begin_src yaml :tangle sharingio-pair-service.yaml
  apiVersion: v1
  kind: Service
  metadata:
    name: sharingio-pair
  spec:
    ports:
    - name: http
      port: 5000
      protocol: TCP
      targetPort: 5000
    selector:
      app.kubernetes.io/name: humacs
#+end_src

Create an Ingress mapping
#+begin_src yaml :tangle sharingio-pair-ingress.yaml :noweb yes
apiVersion: networking.k8s.io/v1beta1
kind: Ingress
metadata:
  name: sharingio-pair
spec:
  rules:
  - host: <<get-pair-host()>>
    http:
      paths:
      - backend:
          serviceName: sharingio-pair
          servicePort: 5000
        path: /
#+end_src

#+begin_src shell :results silent
  kubectl apply -f sharingio-pair-service.yaml -f sharingio-pair-ingress.yaml
#+end_src

#+RESULTS:
#+begin_example
service/sharingio-pair created
ingress.networking.k8s.io/sharingio-pair created
#+end_example

** Certs (optional)

Create a Certificate (management resource)
#+begin_src yaml :tangle sharingio-pair-certificate.yaml :noweb yes
apiVersion: cert-manager.io/v1
kind: Certificate
metadata:
  name: letsencrypt-prod-sharingio-pair
spec:
  secretName: letsencrypt-prod-sharingio-pair
  issuerRef:
    name: letsencrypt-prod-sharingio-pair
    kind: ClusterIssuer
    group: cert-manager.io
  dnsNames:
    - <<get-pair-host()>>
#+end_src

Create a ClusterIssuer resource
#+begin_src yaml :tangle sharingio-pair-cluster-issuer.yaml :noweb yes
apiVersion: cert-manager.io/v1
kind: ClusterIssuer
metadata:
  name: letsencrypt-prod-sharingio-pair
spec:
  acme:
    server: https://acme-v02.api.letsencrypt.org/directory
    email: pair-sharing-io-certificates@ii.coop
    privateKeySecretRef:
      name: letsencrypt-prod-sharingio-pair
    solvers:
      - http01:
          ingress:
            class: nginx
        selector:
          dnsNames:
            - <<get-pair-host()>>
#+end_src

Create an Ingress mapping
#+begin_src yaml :tangle sharingio-pair-ingress-tls.yaml :noweb yes
  apiVersion: networking.k8s.io/v1beta1
  kind: Ingress
  metadata:
    name: sharingio-pair
    annotations:
      nginx.ingress.kubernetes.io/rewrite-target: /
      kubernetes.io/ingress.class: nginx
      certmanager.k8s.io/cluster-issuer: "letsencrypt-prod-sharingio-pair"
      certmanager.k8s.io/acme-challenge-type: http01
  spec:
    tls:
    - hosts:
      - <<get-pair-host()>>
      secretName: letsencrypt-prod-sharingio-pair
    rules:
    - host: <<get-pair-host()>>
      http:
        paths:
        - backend:
            serviceName: sharingio-pair
            servicePort: 5000
          path: /
#+end_src

#+begin_src shell :results silent
  kubectl apply -f sharingio-pair-certificate.yaml -f sharingio-pair-cluster-issuer.yaml -f sharingio-pair-ingress-tls.yaml
#+end_src

* Build

Create Java jar files out of the clojure
#+begin_src shell :dir ../../ :results silent
  lein uberjar
#+end_src

* Create a database

Create a namespace
#+begin_src shell
  kubectl create ns pair
#+end_src

#+RESULTS:
#+begin_example
namespace/pair created
#+end_example

Create the database secrets
#+begin_src shell
  kubectl -n pair create secret generic postgres-configuration \
    --from-literal=POSTGRES_DB=pair \
    --from-literal=POSTGRES_USER=pair \
    --from-literal=POSTGRES_PASSWORD=pair \
    --from-literal=PGUSER=pair \
    --from-literal=PGPASSWORD=pair \
    --from-literal=PGDATABASE=pair
#+end_src

#+RESULTS:
#+begin_example
secret/postgres-configuration created
#+end_example

Create the Postgres instance
#+begin_src shell
  kubectl -n pair apply -f postgres.yaml
#+end_src

#+RESULTS:
#+begin_example
service/postgres created
statefulset.apps/postgres created
#+end_example

* Config
#+begin_src elisp :results none
  (setenv "BACKEND_ADDRESS" (read-from-minibuffer "BACKEND_ADDRESS(localhost:8080 if dev): "))
  (setenv "OAUTH_CLIENT_ID" (read-from-minibuffer "OAUTH_CLIENT_ID: "))
  (setenv "OAUTH_CLIENT_SECRET" (read-from-minibuffer "OAUTH_CLIENT_SECRET: "))
#+end_src

#+name: get-oauth-client-id
#+begin_src elisp :results silent
  (getenv "OAUTH_CLIENT_ID")
#+end_src

#+name: get-oauth-client-secret
#+begin_src elisp :results silent
  (getenv "OAUTH_CLIENT_SECRET")
#+end_src

#+name: get-backend-address
#+begin_src elisp :results silent
  (getenv "BACKEND_ADDRESS")
#+end_src

#+begin_src shell :tangle ../../.env :noweb yes
  DATABASE_URL=postgres://pair:pair@postgres.pair/pair?sslmode=disable
  SESSION_SECRET=hahahahahahahaha
  CANONICAL_URL=<<get-pair-host()>>
  SUBDOMAIN=%s.%s.<<get-pair-host()>>
  BACKEND_ADDRESS=<<get-backend-address()>>
  OAUTH_CLIENT_ID=<<get-oauth-client-id()>>
  OAUTH_CLIENT_SECRET=<<get-oauth-client-secret()>>
#+end_src

#+RESULTS:
#+begin_example
#+end_example

* Migrate the database

Run migrations
#+begin_src shell :dir ../../
  export $(cat .env | xargs)
  lein run -m syme.db
#+end_src

#+RESULTS:
#+begin_example
Running migration: initial-schema
Running migration: add-instance-id
Running migration: add-shutdown-token
#+end_example

* Launching

Run this in a separate window, so it doesn't hold up the buffer:
#+begin_src shell :dir ../../
  export $(cat .env | xargs)
  java $JVM_OPTS -cp target/uberjar/syme-standalone.jar clojure.main -m syme.web
#+end_src


